{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 70], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_left"}, "name": "input_left", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 70], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_right"}, "name": "input_right", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "batch_input_shape": [null, 70], "dtype": "float32", "input_dim": 70, "output_dim": 69, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 70}, "name": "embedding", "inbound_nodes": [[["input_left", 0, 0, {}]], [["input_right", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d", "inbound_nodes": [[["embedding", 0, 0, {}]], [["embedding", 1, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d", "inbound_nodes": [[["conv1d", 0, 0, {}]], [["conv1d", 1, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_1", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]], [["max_pooling1d", 1, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_layer", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 11}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 12}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 13}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["conv1d_1", 0, 0, {}]], [["conv1d_1", 1, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "similarity", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAIAAAAUwAAAHM2AAAAdABqAWoCoAN0AGoBagJqBHQAagFqAqAFfABk\nARkAfABkAhkAGAChAWQCZANkBI0DCwChAVMAKQVO6QAAAADpAQAAAFQpAtoEYXhpc9oIa2VlcGRp\nbXMpBtoCdGbaBWtlcmFz2gdiYWNrZW5k2gNleHDaA3N1bdoDYWJzqQHaAXipAHINAAAA+l0vaG9t\nZS9yc25zMDEvc3R1ZDIvaXQva2FtYWl0MDIvdW5peC9TcGFyZVBhcnRzTWF0Y2hpbmcvbXVlbnN0\nby9tYXJrdHBpbG90L25uX2JpZGlyZWN0aW9uYWwucHnaCDxsYW1iZGE+QwAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "nn_bidirectional", "output_shape": ["4wEAAAAAAAAAAAAAAAEAAAACAAAAUwAAAHMIAAAAfABkARkAUwApAk7pAAAAAKkAqQHaAXhyAgAA\nAHICAAAA+l0vaG9tZS9yc25zMDEvc3R1ZDIvaXQva2FtYWl0MDIvdW5peC9TcGFyZVBhcnRzTWF0\nY2hpbmcvbXVlbnN0by9tYXJrdHBpbG90L25uX2JpZGlyZWN0aW9uYWwucHnaCDxsYW1iZGE+RAAA\nAPMAAAAA\n", null, null], "output_shape_type": "lambda", "output_shape_module": "nn_bidirectional", "arguments": {}}, "name": "similarity", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["bidirectional", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["similarity", 0, 0, {}]]]}], "input_layers": [["input_left", 0, 0], ["input_right", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.7.0", "backend": "tensorflow"}
